# coding=utf8

"""
Перевести раскладку клавиатуры
qwerty123 => йцукен123
"""

# Можно было бы генерировать на лету, но нет.
language_map = {u"Й": u"Q", u"Q": u"Й", u"й": u"q", u"q": u"й", u"Ц": u"W", u"W": u"Ц", u"ц": u"w", u"w": u"ц",
                u"У": u"E", u"E": u"У", u"у": u"e", u"e": u"у", u"К": u"R", u"R": u"К", u"к": u"r", u"r": u"к",
                u"Е": u"T", u"T": u"Е", u"е": u"t", u"t": u"е", u"Н": u"Y", u"Y": u"Н", u"н": u"y", u"y": u"н",
                u"Г": u"U", u"U": u"Г", u"г": u"u", u"u": u"г", u"Ш": u"I", u"I": u"Ш", u"ш": u"i", u"i": u"ш",
                u"Щ": u"O", u"O": u"Щ", u"щ": u"o", u"o": u"щ", u"З": u"P", u"P": u"З", u"з": u"p", u"p": u"з",
                u"Х": u"[", u"[": u"х", u"х": u"[", u"Ъ": u"]", u"]": u"ъ", u"ъ": u"]", u"Ф": u"A", u"A": u"Ф",
                u"ф": u"a", u"a": u"ф", u"Ы": u"S", u"S": u"Ы", u"ы": u"s", u"s": u"ы", u"В": u"D", u"D": u"В",
                u"в": u"d", u"d": u"в", u"А": u"F", u"F": u"А", u"а": u"f", u"f": u"а", u"П": u"G", u"G": u"П",
                u"п": u"g", u"g": u"п", u"Р": u"H", u"H": u"Р", u"р": u"h", u"h": u"р", u"О": u"J", u"J": u"О",
                u"о": u"j", u"j": u"о", u"Л": u"K", u"K": u"Л", u"л": u"k", u"k": u"л", u"Д": u"L", u"L": u"Д",
                u"д": u"l", u"l": u"д", u"Ж": u";", u";": u"ж", u"ж": u";", u"Э": u"'", u"'": u"э", u"э": u"'",
                u"Я": u"Z", u"Z": u"Я", u"я": u"z", u"z": u"я", u"Ч": u"X", u"X": u"Ч", u"ч": u"x", u"x": u"ч",
                u"С": u"C", u"C": u"С", u"с": u"c", u"c": u"с", u"М": u"V", u"V": u"М", u"м": u"v", u"v": u"м",
                u"И": u"B", u"B": u"И", u"и": u"b", u"b": u"и", u"Т": u"N", u"N": u"Т", u"т": u"n", u"n": u"т",
                u"Ь": u"M", u"M": u"Ь", u"ь": u"m", u"m": u"ь", u"Б": u",", u",": u"б", u"б": u",", u"Ю": u".",
                u".": u"ю", u"ю": u".", }


def convert_layout(word):
    # Генератор списков работают чуть быстрее.
    # Поэтому он тут
    # лучше бы word был unicode'ом
    return u''.join([language_map.get(w, w) for w in word])
